[DIALOG_100]
DIALOG_TITLE=About RKDeviceManage
LABEL_1003=
LABEL_1004=RKDeviceManage
LABEL_1005=Ver: 
LABEL_1006=Copyright by Fuzhou Rockchip
[DIALOG_102]
BUTTON_1008=Firmware Information
BUTTON_1010=...
BUTTON_1017=Device Information
BUTTON_1027=Language
BUTTON_1028=Upgrade
BUTTON_1029=Restore
BUTTON_1030=Exit
DIALOG_TITLE=RKDeviceManage
LABEL_1005=
LABEL_1006=
LABEL_1011=FW Ver:
LABEL_1013=Loader Ver:
LABEL_1015=Support Chip:
LABEL_1018=System Ver:
LABEL_1020=Loader Ver:
LABEL_1022=Chip Type:
LABEL_1024=
LABEL_1025=00:00
LABEL_1026=

[PROMPT]
IDS_FOUNDONEDEVICE=Found One %s Device
IDS_FOUNDMANYDEVICE=Found Many Devices
IDS_FOUNDNODEVICE=No Found any Devices
IDS_LOADFWFAIL=Load Firmware Failed!
IDS_LOADINGFW=Loading firmware...

IDS_ERRBYLOADCFGFAIL=This operation didn't do,because of failing to load config information!
IDS_ERRBYLOADFWFAIL=This operation didn't do,because of failing to load firmware!
IDS_ERRBYOTHERRUNNING=This operation didn't do,because of other operation running!

IDS_ERRBYNOFOUNDDEVICE=This operation didn't do,because of no device!
IDS_ERRBYFOUNDMANYDEVICE=This operation didn't do,because of existing many devices!
IDS_ERRBYGETDEVICEDESC=This operation didn't do,because of failing to get description of device!
IDS_ERRBYCREATESTEPFAIL=This operation didn't do,because of failing to create step!
IDS_ERRBYSETOBJECTFAIL=This operation didn't do,because of failing to create object!
IDS_ERRBYNOTSUPPORTACTION=This operation didn't do,because of not supporting!
IDS_ERRBYPRODUCTMODEL=This operation didn't do,because of failing to check product model!

IDS_ERRBYGETDRIVEFAIL=This operation didn't do,because of failing to get drive!
IDS_ERRBYSWITCHFAIL=This operation didn't do,because of failing to switch!
IDS_ERRBYWAITFAIL=This operation didn't do,because of failing to wait device!
IDS_ERRBYGETIDFAIL=This operation didn't do,because of failing to get id of device!
IDS_ERRBYINSTALLDRIVERFAIL=This operation didn't do,because of failing to install rockusb driver!

IDS_WAITDEVICERECONNECT=Waiting for reconnecting device
IDS_INSTALLDRIVERSTART=Install rockusb driver start

IDS_CONFIRMGO=Subsequent operations will make your data lose,please backup your data ,do you want to continue?

IDS_UPGRADEHEAD=Upgrade Now
IDS_RESTOREHEAD=Restore Now
IDS_UPGRADEEND=Upgrade OK
IDS_UPGRADEFAILEND=Upgrade Fail,Reason:%s
IDS_RESTOREEND=Restore OK
IDS_RESTOREFAILEND=Restore Fail,Reason:%s

IDS_TESTDEVICEPROGRESSINFO=Test Device Total(%d),Current(%d)
IDS_LOWERFORMATPROGRESSINFO=Lowerformat Device Total(%d),Current(%d)
IDS_DOWNLOADIMAGEPROGRESSINFO=Download Image Total(%dK),Current(%dK)
IDS_CHECKIMAGEPROGRESSINFO=Check Image Total(%dK),Current(%dK)
IDS_TAGBADBLOCKPROGRESSINFO=Tag Bad Block Total(%d),Current(%d)
IDS_TESTBLOCKPROGRESSINFO=Test Block Total(%d),Current(%d)
IDS_ERASEFLASHPROGRESSINFO=Erase Flash Total(%d),Current(%d)
IDS_ERASESYSTEMPROGRESSINFO=Erase System Partition Total(%d),Current(%d)

IDS_DOWNLOADBOOT_START=Download Boot Start
IDS_DOWNLOADBOOT_FAIL=Download Boot Fail
IDS_DOWNLOADBOOT_PASS=Download Boot Success
IDS_DOWNLOADIDBLOCK_START=Download IDB Start
IDS_DOWNLOADIDBLOCK_FAIL=Download IDB Fail
IDS_DOWNLOADIDBLOCK_PASS=Download IDB Success
IDS_DOWNLOADIMAGE_START=Download Firmware Start
IDS_DOWNLOADIMAGE_FAIL=Download Firmware Fail
IDS_DOWNLOADIMAGE_PASS=Download Firmware Success
IDS_TESTDEVICE_START=Test Device Start
IDS_TESTDEVICE_FAIL=Test Device Fail
IDS_TESTDEVICE_PASS=Test Device Success
IDS_LOWERFORMATDEVICE_START=Lowerformat Device Start
IDS_LOWERFORMATDEVICE_FAIL=Lowerformat Device Fail
IDS_LOWERFORMATDEVICE_PASS=Lowerformat Device Success
IDS_RESETDEVICE_START=Reset Device Start
IDS_RESETDEVICE_FAIL=Reset Device Fail
IDS_RESETDEVICE_PASS=Reset Device Success
IDS_FORMATDISK_START=Format Disk Start
IDS_FORMATDISK_FAIL=Format Disk Fail
IDS_FORMATDISK_PASS=Format Disk Success
IDS_COPYDATA_START=Copy Data Start
IDS_COPYDATA_FAIL=Copy Data Fail
IDS_COPYDATA_PASS=Copy Data Success
IDS_WAITMSC_START=Wait For MSC Start
IDS_WAITMSC_FAIL=Wait For MSC Fail
IDS_WAITMSC_PASS=Wait For MSC Success
IDS_WAITLOADER_START=Wait For Loader Start
IDS_WAITLOADER_FAIL=Wait For Loader Fail
IDS_WAITLOADER_PASS=Wait For Loader Success
IDS_WAITMASKROM_START=Wait For Maskrom Start
IDS_WAITMASKROM_FAIL=Wait For Maskrom Fail
IDS_WAITMASKROM_PASS=Wait For Maskrom Success
IDS_ERASEIDB_START=Erase IDB Start
IDS_ERASEIDB_FAIL=Erase IDB Fail
IDS_ERASEIDB_PASS=Erase IDB Success
IDS_SWITCHMSC_START=Switch MSC Start
IDS_SWITCHMSC_FAIL=Switch MSC Fail
IDS_SWITCHMSC_PASS=Switch MSC Success
IDS_SHOWUSERDISK_START=Show User Disk Start
IDS_SHOWUSERDISK_FAIL=Show User Disk Fail
IDS_SHOWUSERDISK_PASS=Show User Disk Success
IDS_SHOWDATADISK_START=Show Data Disk Start
IDS_SHOWDATADISK_FAIL=Show Data Disk Fail
IDS_SHOWDATADISK_PASS=Show Data Disk Success
IDS_CHECKCHIP_START=Check Chip Start
IDS_CHECKCHIP_FAIL=Check Chip Fail
IDS_CHECKCHIP_PASS=Check Chip Success
IDS_GETFLASHINFO_START=Get FlashInfo Start
IDS_GETFLASHINFO_FAIL=Get FlashInfo Fail
IDS_GETFLASHINFO_PASS=Get FlashInfo Success
IDS_PREPAREIDB_START=Prepare IDB Start
IDS_PREPAREIDB_FAIL=Prepare IDB Fail
IDS_PREPAREIDB_PASS=Prepare IDB Success
IDS_MUTEXRESETDEVICE_START=Mutex Reset Device Start
IDS_MUTEXRESETDEVICE_FAIL=Mutex Reset Device Fail
IDS_MUTEXRESETDEVICE_PASS=Mutex Reset Device Success
IDS_GETOLDDISKSIZE_START=Get Device Disk Size Start
IDS_GETOLDDISKSIZE_FAIL=Get Device Disk Size Fail
IDS_GETOLDDISKSIZE_PASS=Get Device Disk Size Success
IDS_READSN_START=Read SN Start
IDS_READSN_FAIL=Read SN Fail
IDS_READSN_PASS=Read SN Success
IDS_WRITESN_START=Write SN Start
IDS_WRITESN_FAIL=Write SN Fail
IDS_WRITESN_PASS=Write SN Success
IDS_ERASEALLBLOCKS_START=Erase Flash Start
IDS_ERASEALLBLOCKS_FAIL=Erase Flash Fail
IDS_ERASEALLBLOCKS_PASS=Erase Flash Success
IDS_GETBLOCKSTATE_START=Get Block State Start
IDS_GETBLOCKSTATE_FAIL=Get Block State Fail
IDS_GETBLOCKSTATE_PASS=Get Block State Success
IDS_FINDUSERDISK_START=Find User Disk Start
IDS_FINDUSERDISK_FAIL=Find User Disk Fail
IDS_FINDUSERDISK_PASS=Find User Disk Pass
IDS_FINDDATADISK_START=Find Data Disk Start
IDS_FINDDATADISK_FAIL=Find Data Disk Fail
IDS_FINDDATADISK_PASS=Find Data Disk Pas